{
  "transform_params" : {
    "image" : {
      "bias_a" : 0,
      "bias_g" : -1,
      "bias_r" : -1,
      "bias_b" : -1,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 0.0078431377187371254
    }
  },
  "properties" : {

  },
  "storage" : "model.espresso.weights",
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/Conv\/Relu6:0",
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "MobilenetV2\/Conv\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "image",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/Conv\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/Conv\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/Conv\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/Conv\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/Conv\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/Conv\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/Conv\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/Conv\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/Conv\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv\/depthwise\/Relu6:0",
      "K" : 48,
      "blob_biases" : 5,
      "name" : "MobilenetV2\/expanded_conv\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "MobilenetV2\/Conv\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilenetV2\/expanded_conv\/project\/BatchNorm\/FusedBatchNorm:0",
      "K" : 48,
      "blob_biases" : 9,
      "name" : "MobilenetV2\/expanded_conv\/project\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "MobilenetV2\/expanded_conv\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 11
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_1\/expand\/Relu6:0",
      "K" : 24,
      "blob_biases" : 13,
      "name" : "MobilenetV2\/expanded_conv_1\/expand\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "MobilenetV2\/expanded_conv\/project\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_1\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_1\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_1\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_1\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_1\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_1\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_1\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_1\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_1\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0",
      "K" : 144,
      "blob_biases" : 17,
      "stride_x" : 2,
      "name" : "MobilenetV2\/expanded_conv_1\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "MobilenetV2\/expanded_conv_1\/expand\/Relu6:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilenetV2\/expanded_conv_1\/project\/BatchNorm\/FusedBatchNorm:0",
      "K" : 144,
      "blob_biases" : 21,
      "name" : "MobilenetV2\/expanded_conv_1\/project\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_2\/expand\/Relu6:0",
      "K" : 32,
      "blob_biases" : 25,
      "name" : "MobilenetV2\/expanded_conv_2\/expand\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "MobilenetV2\/expanded_conv_1\/project\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_2\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_2\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_2\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_2\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_2\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_2\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_2\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_2\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_2\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0",
      "K" : 192,
      "blob_biases" : 29,
      "name" : "MobilenetV2\/expanded_conv_2\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "MobilenetV2\/expanded_conv_2\/expand\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilenetV2\/expanded_conv_2\/project\/BatchNorm\/FusedBatchNorm:0",
      "K" : 192,
      "blob_biases" : 33,
      "name" : "MobilenetV2\/expanded_conv_2\/project\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 35
    },
    {
      "alpha" : 1,
      "bottom" : "MobilenetV2\/expanded_conv_2\/project\/BatchNorm\/FusedBatchNorm:0,MobilenetV2\/expanded_conv_1\/project\/BatchNorm\/FusedBatchNorm:0",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "MobilenetV2\/expanded_conv_2\/add:0",
      "type" : "elementwise",
      "name" : "MobilenetV2\/expanded_conv_2\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_3\/expand\/Relu6:0",
      "K" : 32,
      "blob_biases" : 37,
      "name" : "MobilenetV2\/expanded_conv_3\/expand\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "MobilenetV2\/expanded_conv_2\/add:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 39
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_3\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_3\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_3\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_3\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_3\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_3\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_3\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_3\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_3\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0",
      "K" : 192,
      "blob_biases" : 41,
      "stride_x" : 2,
      "name" : "MobilenetV2\/expanded_conv_3\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "MobilenetV2\/expanded_conv_3\/expand\/Relu6:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 43
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilenetV2\/expanded_conv_3\/project\/BatchNorm\/FusedBatchNorm:0",
      "K" : 192,
      "blob_biases" : 45,
      "name" : "MobilenetV2\/expanded_conv_3\/project\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_4\/expand\/Relu6:0",
      "K" : 48,
      "blob_biases" : 49,
      "name" : "MobilenetV2\/expanded_conv_4\/expand\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "MobilenetV2\/expanded_conv_3\/project\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_4\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_4\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_4\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_4\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_4\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_4\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_4\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_4\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_4\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0",
      "K" : 288,
      "blob_biases" : 53,
      "name" : "MobilenetV2\/expanded_conv_4\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "MobilenetV2\/expanded_conv_4\/expand\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 55
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilenetV2\/expanded_conv_4\/project\/BatchNorm\/FusedBatchNorm:0",
      "K" : 288,
      "blob_biases" : 57,
      "name" : "MobilenetV2\/expanded_conv_4\/project\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "alpha" : 1,
      "bottom" : "MobilenetV2\/expanded_conv_4\/project\/BatchNorm\/FusedBatchNorm:0,MobilenetV2\/expanded_conv_3\/project\/BatchNorm\/FusedBatchNorm:0",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "MobilenetV2\/expanded_conv_4\/add:0",
      "type" : "elementwise",
      "name" : "MobilenetV2\/expanded_conv_4\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_5\/expand\/Relu6:0",
      "K" : 48,
      "blob_biases" : 61,
      "name" : "MobilenetV2\/expanded_conv_5\/expand\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "MobilenetV2\/expanded_conv_4\/add:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_5\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_5\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_5\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_5\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_5\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_5\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_5\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_5\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_5\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0",
      "K" : 288,
      "blob_biases" : 65,
      "name" : "MobilenetV2\/expanded_conv_5\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "MobilenetV2\/expanded_conv_5\/expand\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 67
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilenetV2\/expanded_conv_5\/project\/BatchNorm\/FusedBatchNorm:0",
      "K" : 288,
      "blob_biases" : 69,
      "name" : "MobilenetV2\/expanded_conv_5\/project\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 71
    },
    {
      "alpha" : 1,
      "bottom" : "MobilenetV2\/expanded_conv_5\/project\/BatchNorm\/FusedBatchNorm:0,MobilenetV2\/expanded_conv_4\/add:0",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "MobilenetV2\/expanded_conv_5\/add:0",
      "type" : "elementwise",
      "name" : "MobilenetV2\/expanded_conv_5\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_6\/expand\/Relu6:0",
      "K" : 48,
      "blob_biases" : 73,
      "name" : "MobilenetV2\/expanded_conv_6\/expand\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "MobilenetV2\/expanded_conv_5\/add:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 75
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_6\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_6\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_6\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_6\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_6\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_6\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_6\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_6\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_6\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0",
      "K" : 288,
      "blob_biases" : 77,
      "stride_x" : 2,
      "name" : "MobilenetV2\/expanded_conv_6\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "MobilenetV2\/expanded_conv_6\/expand\/Relu6:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 79
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilenetV2\/expanded_conv_6\/project\/BatchNorm\/FusedBatchNorm:0",
      "K" : 288,
      "blob_biases" : 81,
      "name" : "MobilenetV2\/expanded_conv_6\/project\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 88,
      "bottom" : "MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 83
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_7\/expand\/Relu6:0",
      "K" : 88,
      "blob_biases" : 85,
      "name" : "MobilenetV2\/expanded_conv_7\/expand\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 528,
      "bottom" : "MobilenetV2\/expanded_conv_6\/project\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 87
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_7\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_7\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_7\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_7\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_7\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_7\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_7\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_7\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_7\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0",
      "K" : 528,
      "blob_biases" : 89,
      "name" : "MobilenetV2\/expanded_conv_7\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 528,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 528,
      "bottom" : "MobilenetV2\/expanded_conv_7\/expand\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 91
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilenetV2\/expanded_conv_7\/project\/BatchNorm\/FusedBatchNorm:0",
      "K" : 528,
      "blob_biases" : 93,
      "name" : "MobilenetV2\/expanded_conv_7\/project\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 88,
      "bottom" : "MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 95
    },
    {
      "alpha" : 1,
      "bottom" : "MobilenetV2\/expanded_conv_7\/project\/BatchNorm\/FusedBatchNorm:0,MobilenetV2\/expanded_conv_6\/project\/BatchNorm\/FusedBatchNorm:0",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "MobilenetV2\/expanded_conv_7\/add:0",
      "type" : "elementwise",
      "name" : "MobilenetV2\/expanded_conv_7\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_8\/expand\/Relu6:0",
      "K" : 88,
      "blob_biases" : 97,
      "name" : "MobilenetV2\/expanded_conv_8\/expand\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 528,
      "bottom" : "MobilenetV2\/expanded_conv_7\/add:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 99
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_8\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_8\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_8\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_8\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_8\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_8\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_8\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_8\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_8\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0",
      "K" : 528,
      "blob_biases" : 101,
      "name" : "MobilenetV2\/expanded_conv_8\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 528,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 528,
      "bottom" : "MobilenetV2\/expanded_conv_8\/expand\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 103
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilenetV2\/expanded_conv_8\/project\/BatchNorm\/FusedBatchNorm:0",
      "K" : 528,
      "blob_biases" : 105,
      "name" : "MobilenetV2\/expanded_conv_8\/project\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 88,
      "bottom" : "MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 107
    },
    {
      "alpha" : 1,
      "bottom" : "MobilenetV2\/expanded_conv_8\/project\/BatchNorm\/FusedBatchNorm:0,MobilenetV2\/expanded_conv_7\/add:0",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "MobilenetV2\/expanded_conv_8\/add:0",
      "type" : "elementwise",
      "name" : "MobilenetV2\/expanded_conv_8\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_9\/expand\/Relu6:0",
      "K" : 88,
      "blob_biases" : 109,
      "name" : "MobilenetV2\/expanded_conv_9\/expand\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 528,
      "bottom" : "MobilenetV2\/expanded_conv_8\/add:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 111
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_9\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_9\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_9\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_9\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_9\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_9\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_9\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_9\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_9\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0",
      "K" : 528,
      "blob_biases" : 113,
      "name" : "MobilenetV2\/expanded_conv_9\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 528,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 528,
      "bottom" : "MobilenetV2\/expanded_conv_9\/expand\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 115
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilenetV2\/expanded_conv_9\/project\/BatchNorm\/FusedBatchNorm:0",
      "K" : 528,
      "blob_biases" : 117,
      "name" : "MobilenetV2\/expanded_conv_9\/project\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 88,
      "bottom" : "MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 119
    },
    {
      "alpha" : 1,
      "bottom" : "MobilenetV2\/expanded_conv_9\/project\/BatchNorm\/FusedBatchNorm:0,MobilenetV2\/expanded_conv_8\/add:0",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "MobilenetV2\/expanded_conv_9\/add:0",
      "type" : "elementwise",
      "name" : "MobilenetV2\/expanded_conv_9\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_10\/expand\/Relu6:0",
      "K" : 88,
      "blob_biases" : 121,
      "name" : "MobilenetV2\/expanded_conv_10\/expand\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 528,
      "bottom" : "MobilenetV2\/expanded_conv_9\/add:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 123
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_10\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_10\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_10\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_10\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_10\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_10\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_10\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_10\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_10\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_10\/depthwise\/Relu6:0",
      "K" : 528,
      "blob_biases" : 125,
      "name" : "MobilenetV2\/expanded_conv_10\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 528,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 528,
      "bottom" : "MobilenetV2\/expanded_conv_10\/expand\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 127
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_10\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_MobilenetV2\/expanded_conv_10\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobilenetV2\/expanded_conv_10\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_MobilenetV2\/expanded_conv_10\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_10\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobilenetV2\/expanded_conv_10\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_10\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "MobilenetV2\/expanded_conv_10\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "MobilenetV2\/expanded_conv_10\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobilenetV2\/expanded_conv_10\/project\/BatchNorm\/FusedBatchNorm:0",
      "K" : 528,
      "blob_biases" : 129,
      "name" : "MobilenetV2\/expanded_conv_10\/project\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 136,
      "bottom" : "MobilenetV2\/expanded_conv_10\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 131
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_MobilenetV2\/expanded_conv_11\/expand\/Relu6:0",
      "K" : 136,
      "blob_biases" : 133,
      "name" : "MobilenetV2\/expanded_conv_11\/expand\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 816,
      "bottom" : "MobilenetV2\/expanded_conv_10\/project\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 135
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobilenetV2\/expanded_conv_11\/expand\/Relu6:0",
      "weights" : {

